## Handling DateTime Variables

In [1]:
import numpy as np
import pandas as pd

In [3]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

### Dates

In [5]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [9]:
# for any of the DateTime functions to work, you'll have to convert the datatype to 'DateTIme'
date.info()
# Dtype object means "string"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

### Working on Dates

In [13]:
# convert the Datatypes
date['date'] = pd.to_datetime(date['date'])

In [14]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract Year

In [15]:
date['date_year'] = date['date'].dt.year
# dt probably means DateTime
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

#### 2. Extract Month

In [16]:
date['date_year'] = date['date'].dt.month
# these are pretty much inbuilt

In [19]:
# for month name
date['date_month_name'] = date['date'].dt.month_name()
date.sample(5)

          date  product_id  city_id  orders  date_year date_month_name
14  2019-05-29        3833       26     240          5             May
267 2019-07-18        2372       23       1          7            July
673 2019-01-25        6215       22       8          1         January
805 2019-11-28        6339       26       7         11        November
596 2019-08-05        6091       25      92          8          August

#### 3. Extract Days

In [28]:
# day of the month
date['date_day'] = date['date'].dt.day
date.head()

        date  product_id  city_id  orders  date_year date_month_name  date_day
0 2019-12-10        5628       25       3         12        December        10
1 2018-08-15        3646       14     157          8          August        15
2 2018-10-23        1859       25       1         10         October        23
3 2019-08-17        7292       25       1          8          August        17
4 2019-01-06        4344       25       3          1         January         6

In [30]:
# day of the week - number
date['date_dow'] = date['date'].dt.dayofweek
date.head()

,date,product_id,city_id,orders,date_year,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,12,December,10,1
1,2018-08-15,3646,14,157,8,August,15,2
2,2018-10-23,1859,25,1,10,October,23,1
3,2019-08-17,7292,25,1,8,August,17,5
4,2019-01-06,4344,25,3,1,January,6,6

In [33]:
# Day of the week - Name
date['date_dow_name'] = date['date'].dt.day_name()
date.head()
# for some reason this uses Monday as weekend
# Tuesday is considered Day1

,date,product_id,city_id,orders,date_year,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,5628,25,3,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,1,January,6,6,Sunday

In [36]:
# is it a weekend?
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1, 0)
# this applies np.where() to check if the column is present in a list(which has the names of weekends)
# if True set it to '1' else '0'
date.head()

,date,product_id,city_id,orders,date_year,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,1,January,6,6,Sunday,1

#### 4 . Extract Week of the Year

In [38]:
# we have inbuilt function for this as well
date['date_week_num'] = date['date'].dt.week
# dropping the other columns to view better
date.drop(columns=['product_id', 'city_id', 'orders']).head()

C:\Users\vivek\AppData\Local\Temp\ipykernel_17660\1803459917.py:2: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['date_week_num'] = date['date'].dt.week

,date,date_year,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week_num
0,2019-12-10,12,December,10,1,Tuesday,0,50
1,2018-08-15,8,August,15,2,Wednesday,0,33
2,2018-10-23,10,October,23,1,Tuesday,0,43
3,2019-08-17,8,August,17,5,Saturday,1,33
4,2019-01-06,1,January,6,6,Sunday,1,1

#### 5 . Extract Quarter

In [40]:
# same drill
date['quarter'] = date['date'].dt.quarter
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week_num,quarter
0,2019-12-10,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,8,August,17,5,Saturday,1,33,3
4,2019-01-06,1,January,6,6,Sunday,1,1,1

#### 6 . Extract Semester

In [42]:
# there is no direct logic but you can always do this
date['semester'] = np.where(date['date'].isin([1,2]),1,2)
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week_num,quarter,semester
0,2019-12-10,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,1,January,6,6,Sunday,1,1,1,2

#### 7 . Extract Time Elapsed between dates

In [43]:
import datetime

# this will save today's date in this variable
today = datetime.datetime.today()

today

datetime.datetime(2023, 7, 3, 9, 59, 46, 764185)

In [45]:
# you can perform operations using this date
# example difference between the dates(from the dataset) and today's date
today - date['date']
# this will give you the difference which has date, hour, minute and seconds!!!

0     1301 days 09:59:46.764185
1     1783 days 09:59:46.764185
2     1714 days 09:59:46.764185
3     1416 days 09:59:46.764185
4     1639 days 09:59:46.764185
                 ...
995   1729 days 09:59:46.764185
996   1670 days 09:59:46.764185
997   1518 days 09:59:46.764185
998   1583 days 09:59:46.764185
999   1357 days 09:59:46.764185
Name: date, Length: 1000, dtype: timedelta64[ns]

In [47]:
# to get only the dates
(today - date['date']).dt.days
# apply the dt.days method and the result will only have days

0      1301
1      1783
2      1714
3      1416
4      1639
       ...
995    1729
996    1670
997    1518
998    1583
999    1357
Name: date, Length: 1000, dtype: int64

In [49]:
# for months passed
np.round((today - date['date'])/ np.timedelta64(1, 'M'), 0)
# np.timedelta64 can basically give you differnce in any thing
# like no of hours passed, no of months passed or no of years passed
# just change the 'M' to appropricate value

0      43.0
1      59.0
2      56.0
3      47.0
4      54.0
       ...
995    57.0
996    55.0
997    50.0
998    52.0
999    45.0
Name: date, Length: 1000, dtype: float64

### Times

In [50]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [51]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [52]:
# covert string to datetime
time['date'] = pd.to_datetime(time['date'])

In [53]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

#### 1 . extracting Hours, Minutes and Seconds

In [54]:
time['hour'] = time['date'].dt.hour
time['minute'] = time['date'].dt.minute
time['second'] = time['date'].dt.second

time.head()

,date,msg,hour,minute,second
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

### 2. Extracting just the Time from DateTime

In [55]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,minute,second,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

#### 3 . Time Difference

In [57]:
today - time['date']
# this has both date and time

0     3487 days 09:09:46.764185
1     3351 days 10:19:46.764185
2     3837 days 09:38:46.764185
3     3139 days 09:28:46.764185
4     3536 days 10:48:46.764185
                 ...
995   4126 days 09:09:46.764185
996   3447 days 10:45:46.764185
997   3912 days 10:22:46.764185
998   4028 days 10:25:46.764185
999   3300 days 10:34:46.764185
Name: date, Length: 1000, dtype: timedelta64[ns]

In [59]:
# use timedelta64
# for seconds
(today - time['date'])/ np.timedelta64(1, 's')

0      3.013098e+08
1      2.895636e+08
2      3.315515e+08
3      2.712437e+08
4      3.055493e+08
           ...
995    3.565194e+08
996    2.978595e+08
997    3.380342e+08
998    3.480567e+08
999    2.851581e+08
Name: date, Length: 1000, dtype: float64

In [60]:
# for minutes
(today - time['date'])/ np.timedelta64(1, 'm')

0      5.021830e+06
1      4.826060e+06
2      5.525859e+06
3      4.520729e+06
4      5.092489e+06
           ...
995    5.941990e+06
996    4.964326e+06
997    5.633903e+06
998    5.800946e+06
999    4.752635e+06
Name: date, Length: 1000, dtype: float64

In [61]:
# for hours
(today - time['date'])/ np.timedelta64(1, 'h')

0      83697.162990
1      80434.329657
2      92097.646323
3      75345.479657
4      84874.812990
           ...
995    99033.162990
996    82738.762990
997    93898.379657
998    96682.429657
999    79210.579657
Name: date, Length: 1000, dtype: float64